tech_notes/810_pharmaverse_NOTES.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-07-30 Tue 17:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="jim" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfb2beb4">1. My Notes</a>
<ul>
<li><a href="#org9096c00">1.1. Todo</a></li>
<li><a href="#orgcc82aab">1.2. Questions</a></li>
<li><a href="#org9ff8a74">1.3. Terminology:  organizations &amp; standards</a></li>
<li><a href="#org3480ddf">1.4. Videos</a></li>
<li><a href="#org0856b64">1.5. Reading</a></li>
<li><a href="#orgd8d1e24">1.6. R packages (Admiral, teal, &#x2026;)</a></li>
<li><a href="#orgdb56dd9">1.7. tools</a></li>
<li><a href="#org24295ea">1.8. US FDA</a>
<ul>
<li><a href="#orge61838d">1.8.1. ADSL  - required dataset format for CDISC (Adam); patient/treatment level ;</a></li>
<li><a href="#orgb16275c">1.8.2. LOCF https://www.lexjansen.com/nesug/nesug09/po/PO12.pdf</a></li>
</ul>
</li>
<li><a href="#orgc6e8edb">1.9. SAS</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2024-07-15 Mon&gt;</span></span>
</p>
<ul class="org-ul">
<li>Reorganizing, in process</li>
</ul>
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2024-07-08 Mon&gt;</span></span>
</p>
<ul class="org-ul">
<li>Added original <b>Progamming Strategy</b> (from Admiral, .Rmd file) to this document.</li>
<li>First, pandoc -f markdown -t org -o orgmode.org RMDfile.Rmd</li>
<li>Intent is to do add <b>my annotations</b></li>
</ul>

<div id="outline-container-orgfb2beb4" class="outline-2">
<h2 id="orgfb2beb4"><span class="section-number-2">1.</span> My Notes</h2>
<div class="outline-text-2" id="text-1">
<p>
[[BROKEN LINK: *PHARMAVERSE*]
</p>
</div>

<div id="outline-container-org9096c00" class="outline-3">
<h3 id="org9096c00"><span class="section-number-3">1.1.</span> Todo</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>tidyr, tlg?</li>
<li>run @examples;  only when pkg is installed?</li>
<li>templates, blocks of code?</li>
</ul>
</div>
</div>


<div id="outline-container-orgcc82aab" class="outline-3">
<h3 id="orgcc82aab"><span class="section-number-3">1.2.</span> Questions</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Fake/synthetic data; many sources;  which one?</li>
<li>Adam implementation guide?</li>
</ul>
</div>
</div>



<div id="outline-container-org9ff8a74" class="outline-3">
<h3 id="org9ff8a74"><span class="section-number-3">1.3.</span> Terminology:  organizations &amp; standards</h3>
<div class="outline-text-3" id="text-1-3">
<p>
PHUSE (UK) 
pharmaR (original attempt)  -&gt; pharmaverse
R Validation Hub (~50 companies)
</p>

<p>
[[R Submissions Working Group [<a href="https://rconsortium.github.io/submissions-wg/">https://rconsortium.github.io/submissions-wg/</a>]]]
</p>
<ul class="org-ul">
<li>pilot submissions to FDA</li>
</ul>

<p>
CDISC Glossary:  <a href="https://evs.nci.nih.gov/ftp1/CDISC/Glossary/CDISC%20Glossary.html">https://evs.nci.nih.gov/ftp1/CDISC/Glossary/CDISC%20Glossary.html</a>
CDISC Video Primer: (how good?) <a href="https://www.cdisc.org/primer">https://www.cdisc.org/primer</a>
</p>

<p>
Adam, SDTM are structures of standards data from CDISC
-Adam 
-SDTM - result of collecting organizing all the RAW DATA, spreadsheets and standardizing to this standard.
</p>
<ul class="org-ul">
<li>PHUSE ?  maintains examples of both.</li>
</ul>

<p>
define.xml (metadata, table, fields&#x2026;)
</p>
</div>
</div>

<div id="outline-container-org3480ddf" class="outline-3">
<h3 id="org3480ddf"><span class="section-number-3">1.4.</span> Videos</h3>
<div class="outline-text-3" id="text-1-4">
<p>
2024 excellent videso:
</p>
<ul class="org-ul">
<li>Clinical Submissions with R(Ben): <a href="https://www.youtube.com/watch?v=5PF6mHeQNS4&amp;list=PLbcglKxZP5PPBplKMO9obNAjLIM7GGfp4&amp;index=9">https://www.youtube.com/watch?v=5PF6mHeQNS4&amp;list=PLbcglKxZP5PPBplKMO9obNAjLIM7GGfp4&amp;index=9</a></li>
<li>2023 Pharmaverse workshop (Admiral walkthrough - good, Ross):  <a href="https://www.youtube.com/watch?v=nHbDmxjVqRM&amp;list=PLbcglKxZP5PPBplKMO9obNAjLIM7GGfp4&amp;index=7">https://www.youtube.com/watch?v=nHbDmxjVqRM&amp;list=PLbcglKxZP5PPBplKMO9obNAjLIM7GGfp4&amp;index=7</a></li>
</ul>
<p>
2022
Coursera: <a href="https://www.coursera.org/learn/hands-on-clinical-reporting-using-r">https://www.coursera.org/learn/hands-on-clinical-reporting-using-r</a>
New contributors <a href="https://www.youtube.com/watch?v=MhEyod3Sevc&amp;list=PLbcglKxZP5PPBplKMO9obNAjLIM7GGfp4&amp;index=3">https://www.youtube.com/watch?v=MhEyod3Sevc&amp;list=PLbcglKxZP5PPBplKMO9obNAjLIM7GGfp4&amp;index=3</a>
</p>
</div>
</div>


<div id="outline-container-org0856b64" class="outline-3">
<h3 id="org0856b64"><span class="section-number-3">1.5.</span> Reading</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>(coding) <a href="https://pharmaverse.github.io/admiral/articles/concepts_conventions.html">https://pharmaverse.github.io/admiral/articles/concepts_conventions.html</a></li>
<li>(programming strategy, ie naming) <a href="https://pharmaverse.github.io/admiraldev/articles/programming_strategy.html">https://pharmaverse.github.io/admiraldev/articles/programming_strategy.html</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgd8d1e24" class="outline-3">
<h3 id="orgd8d1e24"><span class="section-number-3">1.6.</span> R packages (Admiral, teal, &#x2026;)</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Begin here: <a href="https://pharmaverse.org/e2eclinical/">https://pharmaverse.org/e2eclinical/</a>
</p>

<ul class="org-ul">
<li><b><b>Admiral</b></b> overview:  Ben S <a href="https://www.youtube.com/watch?v=5PF6mHeQNS4">https://www.youtube.com/watch?v=5PF6mHeQNS4</a></li>
<li>functions create ADaM structures</li>
<li>Intro (for Pharma Users):  <a href="https://pharmaverse.github.io/admiral/">https://pharmaverse.github.io/admiral/</a></li>
<li><p>
Getting Started (vignette, introducing code) <a href="https://pharmaverse.github.io/admiral/articles/admiral.html">https://pharmaverse.github.io/admiral/articles/admiral.html</a>
</p>

<p>
Developers:
</p></li>
<li>Contributing: <a href="https://pharmaverse.github.io/admiral/CONTRIBUTING.html">https://pharmaverse.github.io/admiral/CONTRIBUTING.html</a></li>
<li>Contribution Model:  broken link</li>
<li>FAQ (some background)<a href="https://pharmaverse.github.io/admiral/articles/faq.html">https://pharmaverse.github.io/admiral/articles/faq.html</a></li>
</ul>


<ul class="org-ul">
<li><b>Admiraldev</b> (some background) <a href="https://pharmaverse.github.io/admiraldev/articles/admiraldev.html">https://pharmaverse.github.io/admiraldev/articles/admiraldev.html</a></li>
</ul>
<p>
Details:
</p>

<ul class="org-ul">
<li>(2nd) Programming Strategy <a href="https://pharmaverse.github.io/admiraldev/articles/programming_strategy.html">https://pharmaverse.github.io/admiraldev/articles/programming_strategy.html</a></li>
<li>(2nd) Coding (rlang etc)<a href="https://pharmaverse.github.io/admiral/articles/concepts_conventions.html">https://pharmaverse.github.io/admiral/articles/concepts_conventions.html</a></li>
<li>(2nd) PR overview <a href="https://pharmaverse.github.io/admiraldev/articles/pr_review_guidance.html">https://pharmaverse.github.io/admiraldev/articles/pr_review_guidance.html</a></li>
<li>(2nd) PR/branches/commits/ <a href="https://pharmaverse.github.io/admiraldev/articles/git_usage.html">https://pharmaverse.github.io/admiraldev/articles/git_usage.html</a></li>

<li><b>datacutr</b> <a href="https://www.youtube.com/watch?v=ZyK-Tiqw5hU&amp;list=PLbcglKxZP5PPBplKMO9obNAjLIM7GGfp4&amp;index=6">https://www.youtube.com/watch?v=ZyK-Tiqw5hU&amp;list=PLbcglKxZP5PPBplKMO9obNAjLIM7GGfp4&amp;index=6</a>
has sample data; functions to restrict data to ONE date, or patients &#x2026; a slice of data</li>

<li><b>metacore</b>  (Atorus, up to 6 datasets, info re:  tables, columns, &#x2026; )</li>
</ul>
<p>
SEE:  <a href="https://github.com/atorus-research/metacore">https://github.com/atorus-research/metacore</a>
ds<sub>spec</sub>  - dataset name, purupse (ex: AE, DM) info
ds<sub>vars</sub> holds each field (columns) of dataset 
var<sub>spec</sub>
</p>

<p>
&#x2026;
File with reference datasets:ds &#x2026; <a href="https://github.com/atorus-research/metacore/blob/main/tests/testthat/test-reader.R">https://github.com/atorus-research/metacore/blob/main/tests/testthat/test-reader.R</a>
holds metadata specs as object; data may arrive in spreasheets or db for &#x2026; (company-specific)
</p>

<ul class="org-ul">
<li><p>
<b>metatools</b> <a href="https://github.com/pharmaverse/metatools">https://github.com/pharmaverse/metatools</a>
</p>

<p>
tools to develop, work with metacore objects (ex:  companies may have different names to describe one entity)
does some preliminary checks  (harder analysis is done in admiral)
</p></li>

<li><b>oak</b></li>

<li><b>random.cdisc.data</b> package:  create random AdAM datasets?</li>
</ul>
<p>
<a href="https://cran.r-project.org/web/packages/random.cdisc.data/random.cdisc.data.pdf">https://cran.r-project.org/web/packages/random.cdisc.data/random.cdisc.data.pdf</a>
</p>

<ul class="org-ul">
<li><b>sdtmchecks</b>
SEE:  <a href="https://www.youtube.com/watch?v=tBL0Eo6CBdw&amp;list=PLbcglKxZP5PPBplKMO9obNAjLIM7GGfp4&amp;index=5">https://www.youtube.com/watch?v=tBL0Eo6CBdw&amp;list=PLbcglKxZP5PPBplKMO9obNAjLIM7GGfp4&amp;index=5</a></li>

<li>PharmaR:    <b>riskmetric</b> package  and a shiny app:  <b>Riskasessment</b></li>

<li><b>TLG</b>  (tables, graphics &#x2026; ie display data)</li>
</ul>
<p>
<a href="https://pharmaverse.org/e2eclinical/tlg/">https://pharmaverse.org/e2eclinical/tlg/</a>
</p>
</div>
</div>



<div id="outline-container-orgdb56dd9" class="outline-3">
<h3 id="orgdb56dd9"><span class="section-number-3">1.7.</span> tools</h3>
<div class="outline-text-3" id="text-1-7">
<p>
phuse.org/valtools (nice spreadsheet)
</p>
</div>
</div>





<div id="outline-container-org24295ea" class="outline-3">
<h3 id="org24295ea"><span class="section-number-3">1.8.</span> US FDA</h3>
<div class="outline-text-3" id="text-1-8">
<p>
eCTR = electronic communications ..
</p>

<p>
SDTM =  Study Data Tabulation Model
</p>

<p>
TLF = Tables, Listings ..
</p>
</div>


<div id="outline-container-orge61838d" class="outline-4">
<h4 id="orge61838d"><span class="section-number-4">1.8.1.</span> ADSL  - required dataset format for CDISC (Adam); patient/treatment level ;</h4>
<div class="outline-text-4" id="text-1-8-1">
<p>
attempt to capture treatments/interventions in a STUDY; must be flexible, yet rigourous.
(clear) <a href="https://www.linkedin.com/pulse/decoding-adsl-treatment-variables-study-designs-clinical-baghai-hhzfe/">https://www.linkedin.com/pulse/decoding-adsl-treatment-variables-study-designs-clinical-baghai-hhzfe/</a>
</p>
</div>
</div>

<div id="outline-container-orgb16275c" class="outline-4">
<h4 id="orgb16275c"><span class="section-number-4">1.8.2.</span> LOCF <a href="https://www.lexjansen.com/nesug/nesug09/po/PO12.pdf">https://www.lexjansen.com/nesug/nesug09/po/PO12.pdf</a></h4>
<div class="outline-text-4" id="text-1-8-2">
<p>
<a href="https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4785044/">https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4785044/</a>
</p>
<ul class="org-ul">
<li>missing observtions?    assume last reported value continues.</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgc6e8edb" class="outline-3">
<h3 id="orgc6e8edb"><span class="section-number-3">1.9.</span> SAS</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Good validation (CDISC STDM/Admiral standard)
</p>

<p>
R has many packages, but who validates?
</p>




<p>
20JUNE ..  next project?
</p>


<p>
<a href="https://github.com/pharmaverse/ggsurvfit">https://github.com/pharmaverse/ggsurvfit</a> (seems interesting)
</p>

<p>
<a href="https://github.com/pharmaverse/envsetup">https://github.com/pharmaverse/envsetup</a> (plumbing can be intersting)
</p>

<p>
<a href="https://github.com/insightsengineering/teal">https://github.com/insightsengineering/teal</a> (70 issues, very active)
</p>

<p>
<a href="https://github.com/pharmaverse/pharmaverseadam/issues/58">https://github.com/pharmaverse/pharmaverseadam/issues/58</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: jim</p>
<p class="date">Created: 2024-07-30 Tue 17:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
